Public Attributes | List of all members
API_AMPartRefCustomVertexData Struct Reference
Analytical Model
Describes a vertex when the analytical member part has custom vertex type. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_Coord3D  | customVertexCoord
The global coordinate of the referenced internal node of the member. This member's guid is stored in API_AnalyticalMemberPartRef.
Detailed Description
Describes a vertex when the analytical member part has custom vertex type.
Since
Archicad 25